-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Май 28 2014 г., 12:01
-- Версия сервера: 5.5.25
-- Версия PHP: 5.2.12

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `tms`
--

-- --------------------------------------------------------

--
-- Структура таблицы `rooms`
--

DROP TABLE IF EXISTS `rooms`;
CREATE TABLE IF NOT EXISTS `rooms` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL COMMENT 'номер аудитории',
  `building` enum('A','B','D','V','S') NOT NULL COMMENT 'корпус (А, Б, Д, В, Спорткомплекс',
  `floor` tinyint(3) unsigned NOT NULL COMMENT 'этаж',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AVG_ROW_LENGTH=585 AUTO_INCREMENT=95 ;

--
-- Дамп данных таблицы `rooms`
--

INSERT INTO `rooms` (`id`, `name`, `building`, `floor`) VALUES
(93, 'А-32', 'A', 3),
(92, 'А-31', 'A', 3),
(91, 'А-29', 'A', 2),
(90, 'А-26', 'A', 2),
(89, 'А-25', 'A', 2),
(88, 'А-20', 'A', 2),
(87, 'А-18', 'A', 1),
(86, 'А-16', 'A', 1),
(85, 'А-12', 'A', 1),
(84, 'А-11', 'A', 1),
(83, 'А-08', 'A', 0),
(82, 'А-06', 'A', 0),
(81, 'А-03', 'A', 0),
(80, 'А-01', 'A', 0),
(15, 'Б-102', 'B', 1),
(16, 'Б-103', 'B', 1),
(17, 'Б-104', 'B', 1),
(18, 'Б-108', 'B', 1),
(19, 'Б-110', 'B', 1),
(20, 'Б-201', 'B', 2),
(21, 'Б-202', 'B', 2),
(22, 'Б-203', 'B', 2),
(23, 'Б-205', 'B', 2),
(24, 'Б-206', 'B', 2),
(25, 'Б-207', 'B', 2),
(26, 'Б-208', 'B', 2),
(27, 'Б-209', 'B', 2),
(28, 'Б-210', 'B', 2),
(29, 'Б-300', 'B', 3),
(30, 'Б-301', 'B', 3),
(31, 'Б-302', 'B', 3),
(32, 'Б-303', 'B', 3),
(33, 'Б-304', 'B', 3),
(34, 'Б-305', 'B', 3),
(35, 'Б-306', 'B', 3),
(36, 'Б-307', 'B', 3),
(37, 'Б-308', 'B', 3),
(38, 'Б-309', 'B', 3),
(39, 'Б-401', 'B', 4),
(40, 'Б-402', 'B', 4),
(41, 'Б-403', 'B', 4),
(42, 'Б-404', 'B', 4),
(43, 'Б-405', 'B', 4),
(44, 'Б-406', 'B', 4),
(45, 'Б-408', 'B', 4),
(46, 'Б-002', 'B', 0),
(47, 'Б-003', 'B', 0),
(48, 'Б-004', 'B', 0),
(49, 'Б-006', 'B', 0),
(50, 'Б-008', 'B', 0),
(51, 'гараж № 3', 'B', 1),
(52, 'Б-410', 'B', 4),
(53, 'БЛК-11', 'B', 1),
(54, 'БЛК-15', 'B', 1),
(55, 'БЛК-31', 'B', 3),
(56, 'В-101', 'V', 1),
(57, 'В-105', 'V', 1),
(58, 'В-108', 'V', 1),
(59, 'В-109', 'V', 1),
(60, 'В-111', 'V', 1),
(61, 'В-201', 'V', 2),
(62, 'В-202', 'V', 2),
(63, 'В-203', 'V', 2),
(64, 'В-204', 'V', 2),
(65, 'В-206', 'V', 2),
(66, 'В-209', 'V', 2),
(67, 'В-211', 'V', 2),
(68, 'Д-101', 'D', 1),
(69, 'Д-102', 'D', 1),
(70, 'Д-106', 'D', 1),
(71, 'Д-116', 'D', 1),
(72, 'Д-201', 'D', 2),
(73, 'Д-202', 'D', 2),
(74, 'Д-207', 'D', 2),
(75, 'Д-218', 'D', 2),
(76, 'Д-221', 'D', 2),
(77, 'Д-222', 'D', 2),
(78, 'Спорткомплекс', 'S', 1),
(79, 'БЛК-17', 'B', 1),
(94, 'Б-009', 'B', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
