-- phpMyAdmin SQL Dump
-- version 3.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Май 27 2014 г., 13:26
-- Версия сервера: 5.5.25
-- Версия PHP: 5.3.13

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `raspisanie`
--

-- --------------------------------------------------------

--
-- Структура таблицы `lecturers`
--

CREATE TABLE IF NOT EXISTS `lecturers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_department` int(255) NOT NULL COMMENT 'id РєР°С„РµРґСЂС‹',
  `name` varchar(50) NOT NULL COMMENT 'РёРјСЏ',
  `surname` varchar(50) NOT NULL COMMENT 'С„Р°РјРёР»РёСЏ',
  `patronymic` varchar(50) DEFAULT NULL COMMENT 'РѕС‚С‡РµСЃС‚РІРѕ',
  `position` enum('ASSISTANT','SENIOR_LECTURER','DOCENT','PROFESSOR') NOT NULL COMMENT 'РґРѕР»Р¶РЅРѕСЃС‚СЊ (Р°СЃСЃРёСЃС‚РµРЅС‚, СЃС‚Р°СЂС€РёР№ РїСЂРµРїРѕРґР°РІР°С‚РµР»СЊ, РґРѕС†РµРЅС‚, РїСЂРѕС„РµСЃСЃРѕСЂ)',
  PRIMARY KEY (`id`),
  KEY `FK_lecturer_department_ID_dep` (`name`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AVG_ROW_LENGTH=303 AUTO_INCREMENT=137 ;

--
-- Дамп данных таблицы `lecturers`
--

INSERT INTO `lecturers` (`id`, `id_department`, `name`, `surname`, `patronymic`, `position`) VALUES
(1, 16, 'Андрей', 'Чулков', 'Александрович', 'ASSISTANT'),
(3, 25, 'Джамиля', 'Агишева', 'Калимулловна', 'SENIOR_LECTURER'),
(4, 25, 'Неля', 'Короткова', 'Николаевна', 'DOCENT'),
(5, 22, 'Владимир', 'Крячко', 'Борисович', 'DOCENT'),
(6, 11, 'Ирина', 'Мокрецова', 'Сергеевна', 'SENIOR_LECTURER'),
(7, 22, 'Наталья', 'Хван', 'Станиславовна', 'SENIOR_LECTURER'),
(8, 13, 'Вера', 'Шабанова', 'Павловна', 'DOCENT'),
(9, 17, 'Виктория', 'Экова', 'Александровна', 'SENIOR_LECTURER'),
(10, 25, 'Светлана', 'Антипина', 'Геннадьевна', 'SENIOR_LECTURER'),
(11, 17, 'Оксана', 'Гаврилова', 'Александровна', 'DOCENT'),
(12, 22, 'Виолетта', 'Гвоздюк', 'Николаевна', 'SENIOR_LECTURER'),
(13, 15, 'Анатолий', 'Гольцов', 'Сергеевич', 'PROFESSOR'),
(14, 14, 'Екатерина', 'Зубович', 'Александровна', 'DOCENT'),
(15, 17, 'Антон', 'Жабунин', 'Юрьевич', 'DOCENT'),
(16, 18, 'Светалана', 'Сидорова', 'Николаевна', 'DOCENT'),
(17, 18, 'Елена', 'Касьян', 'Владимировна', 'SENIOR_LECTURER'),
(18, 18, 'Николай', 'Николаев', 'Юрьевич', 'DOCENT'),
(19, 13, 'Тамара', 'Крекалёва', 'Викторовна', 'SENIOR_LECTURER'),
(20, 26, 'Светлана', 'Лапшина', 'Владимировна', 'DOCENT'),
(21, 13, 'Оксана', 'Новопольцева', 'Михайловна', 'PROFESSOR'),
(22, 29, 'Алексей', 'Синьков', 'Владимирович', 'DOCENT'),
(23, 21, 'Сергей', 'Соломоненко', 'Алексеевич', 'SENIOR_LECTURER'),
(24, 13, 'Инна', 'Хлобжева', 'Николаевна', 'SENIOR_LECTURER'),
(25, 26, 'Владимир', 'Шаповалов', 'Михайлович', 'PROFESSOR'),
(26, 17, 'Валерий', 'Бакаев', 'Викторович', 'SENIOR_LECTURER'),
(27, 22, 'Тамара', 'Галицына', 'Александровна', 'SENIOR_LECTURER'),
(28, 14, 'Галина', 'Зорина', 'Ивановна', 'DOCENT'),
(29, 14, 'Ольга', 'Иванкина', 'Михайловна', 'DOCENT'),
(30, 17, 'Наталья', 'Иевлева', 'Владимировна', 'DOCENT'),
(31, 26, 'Владимир', 'Харитонов', 'Николаевич', 'SENIOR_LECTURER'),
(32, 17, 'Зухра', 'Хворова', 'Асомудиновна', 'SENIOR_LECTURER'),
(33, 18, 'Ирина', 'Чередниченко', 'Аскербиевна', 'DOCENT'),
(34, 16, 'Оксана', 'Абрамова', 'Федоровна', 'SENIOR_LECTURER'),
(35, 13, 'Наталья', 'Соколова', 'Александровна', 'SENIOR_LECTURER'),
(36, 16, 'Валерия', 'Александрова', 'Олеговна', 'SENIOR_LECTURER'),
(37, 25, 'Олег', 'Афанасенков', 'Владимирович', 'SENIOR_LECTURER'),
(38, 26, 'Надежда', 'Бердникова', 'Юрьевна', 'ASSISTANT'),
(39, 23, 'Фания', 'Бинеева', 'Нурулловна', 'SENIOR_LECTURER'),
(40, 20, 'Роман', 'Заболотный', 'Валериевич', 'SENIOR_LECTURER'),
(41, 15, 'Елена', 'Казакова', 'Георгиевна', 'SENIOR_LECTURER'),
(42, 26, 'Сергей', 'Орлов', 'Васильевич', 'SENIOR_LECTURER'),
(43, 18, 'Леонид', 'Самойлов', 'Павлович', 'DOCENT'),
(44, 13, 'Марина', 'Спиридонова', 'Петровна', 'DOCENT'),
(45, 22, 'Константин', 'Белов', 'Александрович', 'DOCENT'),
(46, 17, 'Юлия', 'Гущина', 'Игоревна', 'DOCENT'),
(47, 13, 'Владимир', 'Егоров', 'Алексеевич', 'SENIOR_LECTURER'),
(48, 23, 'Елена', 'Егорычева', 'Владимировна', 'SENIOR_LECTURER'),
(49, 18, 'Ирина', 'Лясина', 'Юрьевна', 'DOCENT'),
(50, 16, 'Игорь', 'Макушкин', 'Александрович', 'SENIOR_LECTURER'),
(51, 21, 'Владимир', 'Санинский', 'Андреевич', 'PROFESSOR'),
(52, 15, 'Борис', 'Севастьянов', 'Георгиевич', 'DOCENT'),
(53, 21, 'Сергей', 'Семенов', 'Всеволодович', 'DOCENT'),
(54, 18, 'Роман', 'Соколов', 'Васильевич', 'SENIOR_LECTURER'),
(55, 17, 'Александра', 'Сычева', 'Васильевна', 'DOCENT'),
(56, 15, 'Максим', 'Трушников', 'Алексеевич', 'SENIOR_LECTURER'),
(57, 15, 'Андрей', 'Бурцев', 'Георгиевич', 'ASSISTANT'),
(58, 21, 'Марина', 'Даниленко', 'Владимировна', 'SENIOR_LECTURER'),
(59, 19, 'Людмила', 'Дижонова', 'Борисовна', 'SENIOR_LECTURER'),
(60, 26, 'Михаил', 'Кореньков', 'Александрович', 'DOCENT'),
(61, 20, 'Алексей', 'Кулько', 'Павлович', 'DOCENT'),
(62, 19, 'Светлана', 'Мусина', 'Викторовна', 'SENIOR_LECTURER'),
(63, 13, 'Карим', 'Саад', 'Рамез', 'DOCENT'),
(64, 17, 'Алла', 'Соколова', 'Викторовна', 'SENIOR_LECTURER'),
(65, 14, 'Гаджи', 'Гаджиев', 'Рабаданович', 'DOCENT'),
(66, 22, 'Валерий', 'Горячев', 'Александрович', 'DOCENT'),
(67, 21, 'Наталья', 'Дворецкая', 'Викторовна', 'DOCENT'),
(68, 15, 'Владимир', 'Корзин', 'Викторович', 'SENIOR_LECTURER'),
(69, 18, 'Максим', 'Опалев', 'Николаевич', 'SENIOR_LECTURER'),
(70, 17, 'Владимир', 'Рекеда', 'Васильевич', 'SENIOR_LECTURER'),
(71, 13, 'Екатерина', 'Уткина', 'Евгеньевна', 'SENIOR_LECTURER'),
(72, 24, 'Виктор', 'Белуха', 'Федорович', 'DOCENT'),
(73, 25, 'Сергей', 'Кузьмин', 'Юрьевич', 'SENIOR_LECTURER'),
(74, 14, 'Галина', 'Курунина', 'Михайловна', 'SENIOR_LECTURER'),
(75, 19, 'Сергей', 'Липовцев', 'Павлович', 'SENIOR_LECTURER'),
(76, 17, 'Геннадий', 'Лукьянов', 'Иванович', 'PROFESSOR'),
(77, 24, 'Зоя', 'Полякова', 'Ивановна', 'DOCENT'),
(78, 13, 'Александр', 'Пучков', 'Федорович', 'DOCENT'),
(79, 25, 'Ирина', 'Ребро', 'Викторовна', 'DOCENT'),
(80, 15, 'Светлана', 'Савченко', 'Николаевна', 'SENIOR_LECTURER'),
(81, 24, 'Александр', 'Саразов', 'Васильевич', 'SENIOR_LECTURER'),
(82, 16, 'Ольга', 'Свиридова', 'Викторовна', 'DOCENT'),
(83, 15, 'Алексей', 'Силаев', 'Александрович', 'SENIOR_LECTURER'),
(84, 21, 'Тамара', 'Тарасова', 'Сергеевна', 'SENIOR_LECTURER'),
(85, 19, 'Инга', 'Чернышева', 'Владимировна', 'SENIOR_LECTURER'),
(86, 13, 'Иван', 'Шиповский', 'Яковлевич', 'PROFESSOR'),
(87, 22, 'Роксана', 'Бабаян', 'Эдвартовна', 'ASSISTANT'),
(88, 21, 'Александр', 'Авилов', 'Викторович', 'DOCENT'),
(89, 23, 'Сергей', 'Зубович', 'Олегович', 'SENIOR_LECTURER'),
(90, 25, 'Татьяна', 'Матвеева', 'Александровна', 'DOCENT'),
(91, 17, 'Татьяна', 'Нестеренко', 'Викторовна', 'DOCENT'),
(92, 14, 'Елена', 'Перевалова', 'Анатольевна', 'DOCENT'),
(93, 14, 'Марина', 'Романова', 'Юрьевна', 'DOCENT'),
(94, 16, 'Валентина', 'Савченко', 'Федоровна', 'SENIOR_LECTURER'),
(95, 24, 'Лидия', 'Староверова', 'Владимировна', 'DOCENT'),
(96, 26, 'Анатолий', 'Ахрамеев', 'Федорович', 'DOCENT'),
(97, 13, 'Сергей', 'Бондаренко', 'Николаевич', 'DOCENT'),
(98, 13, 'Наталья', 'Кейбал', 'Александровна', 'DOCENT'),
(99, 18, 'Виктор', 'Купряхин', 'Васильевич', 'DOCENT'),
(100, 16, 'Лидия', 'Макушкина', 'Александровна', 'SENIOR_LECTURER'),
(101, 15, 'Людмила', 'Медведева', 'Ивановна', 'DOCENT'),
(102, 14, 'Ольга', 'Панюшкина', 'Анатольевна', 'SENIOR_LECTURER'),
(103, 19, 'Любовь', 'Слепова', 'Николаевна', 'DOCENT'),
(104, 20, 'Денис', 'Шиповалов', 'Александрович', 'SENIOR_LECTURER'),
(105, 17, 'Елена', 'Гончарова', 'Вячеславовна', 'DOCENT'),
(106, 14, 'Ольга', 'Жохова', 'Кузьминична', 'DOCENT'),
(107, 23, 'Михаил', 'Кумыш', 'Маркович', 'SENIOR_LECTURER'),
(108, 17, 'Николай', 'Ломакин', 'Иванович', 'DOCENT'),
(109, 17, 'Ольга', 'Максимова', 'Николаевна', 'DOCENT'),
(110, 24, 'Наталия', 'Сторчак', 'Алексеевна', 'DOCENT'),
(111, 19, 'Марина', 'Шлемова', 'Владимировна', 'SENIOR_LECTURER'),
(112, 25, 'Джамиля', 'Мустафина', 'Алиевна', 'DOCENT'),
(113, 14, 'Константин', 'Худяков', 'Валентинович', 'DOCENT'),
(114, 17, 'Светлана', 'Мироседи', 'Андреевна', 'DOCENT'),
(115, 22, 'Ольга', 'Мозговая', 'Владимировна', 'SENIOR_LECTURER'),
(116, 15, 'Елена', 'Силаева', 'Юрьевна', 'ASSISTANT'),
(117, 13, 'Алла', 'Александрина', 'Юрьевна', 'DOCENT'),
(118, 14, 'Сергей', 'Дьяконов', 'Владимирович', 'SENIOR_LECTURER'),
(119, 15, 'Ольга', 'Зуева', 'Владимировна', 'ASSISTANT'),
(120, 30, 'Елена', 'Климова', 'Владимировна', 'DOCENT'),
(121, 18, 'Ольга', 'Силичева', 'Ваниковна', 'DOCENT'),
(122, 32, 'Дмитрий', 'Володин', 'Сергеевич', 'ASSISTANT'),
(123, 15, 'Артем', 'Савчиц', 'Вячеславович', 'ASSISTANT'),
(124, 23, 'Галлия', 'Рахманкулова', 'Алиевна', 'SENIOR_LECTURER'),
(125, 17, 'Мария', 'Невская', 'Сергеевна', 'ASSISTANT'),
(126, 22, 'Игорь', 'Гольцов', 'Анатольевич', 'ASSISTANT'),
(127, 17, 'Татьяна', 'Некрасова', 'Александровна', 'SENIOR_LECTURER'),
(128, 17, 'Татьяна', 'Филиппова', 'Александровна', 'SENIOR_LECTURER'),
(129, 17, 'Александр', 'Александров', 'Владимирович', 'DOCENT'),
(130, 21, 'Артем', 'Митрофанов', 'Петрович', 'ASSISTANT'),
(131, 15, 'Сергей', 'Сальников', 'Николаевич', 'DOCENT'),
(132, 16, 'Марина', 'Фадеева', 'Викторовна', 'SENIOR_LECTURER'),
(133, 20, 'Галина', 'Чернова', 'Анатольевна', 'DOCENT'),
(134, 19, 'Татьяна', 'Хаирова', 'Николаевна', 'SENIOR_LECTURER'),
(135, 23, 'Татьяна', 'Сухова', 'Александровна', 'DOCENT'),
(136, 17, 'Ольга', 'Шиповская', 'Николаевна', 'SENIOR_LECTURER');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
